{
    "metadata": {
        "total_size": 9158254080,
        "total_parameters": 16255643392
    },
    "weight_map": {
        "lm_head.biases": "model-00002-of-00002.safetensors",
        "lm_head.scales": "model-00002-of-00002.safetensors",
        "lm_head.weight": "model-00002-of-00002.safetensors",
        "model.layers.0.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.0.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.0.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.gate.expert_bias": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.gate.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.shared_experts.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.shared_experts.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.shared_experts.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.shared_experts.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.shared_experts.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.shared_experts.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.shared_experts.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.shared_experts.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.shared_experts.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.switch_mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.switch_mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.switch_mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.switch_mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.switch_mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.switch_mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.10.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.10.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.gate.expert_bias": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.gate.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.shared_experts.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.shared_experts.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.shared_experts.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.shared_experts.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.shared_experts.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.shared_experts.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.shared_experts.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.shared_experts.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.shared_experts.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.switch_mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.switch_mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.switch_mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.switch_mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.switch_mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.switch_mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.11.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.11.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.gate.expert_bias": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.gate.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.shared_experts.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.shared_experts.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.shared_experts.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.shared_experts.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.shared_experts.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.shared_experts.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.shared_experts.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.shared_experts.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.shared_experts.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.switch_mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.switch_mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.switch_mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.switch_mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.switch_mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.switch_mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.12.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.12.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.12.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.12.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.gate.expert_bias": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.gate.weight": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.shared_experts.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.shared_experts.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.shared_experts.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.shared_experts.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.shared_experts.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.shared_experts.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.shared_experts.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.shared_experts.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.shared_experts.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.switch_mlp.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.switch_mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.switch_mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.switch_mlp.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.switch_mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.12.mlp.switch_mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.12.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.attention.dense.biases": "model-00002-of-00002.safetensors",
        "model.layers.13.attention.dense.scales": "model-00002-of-00002.safetensors",
        "model.layers.13.attention.dense.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.attention.key_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.attention.query_key_value.biases": "model-00002-of-00002.safetensors",
        "model.layers.13.attention.query_key_value.scales": "model-00002-of-00002.safetensors",
        "model.layers.13.attention.query_key_value.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.attention.query_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.gate.expert_bias": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.gate.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.shared_experts.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.shared_experts.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.shared_experts.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.shared_experts.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.shared_experts.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.shared_experts.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.shared_experts.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.shared_experts.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.shared_experts.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.switch_mlp.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.switch_mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.switch_mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.switch_mlp.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.switch_mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.13.mlp.switch_mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.13.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.attention.dense.biases": "model-00002-of-00002.safetensors",
        "model.layers.14.attention.dense.scales": "model-00002-of-00002.safetensors",
        "model.layers.14.attention.dense.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.attention.key_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.attention.query_key_value.biases": "model-00002-of-00002.safetensors",
        "model.layers.14.attention.query_key_value.scales": "model-00002-of-00002.safetensors",
        "model.layers.14.attention.query_key_value.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.attention.query_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.gate.expert_bias": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.gate.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.shared_experts.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.shared_experts.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.shared_experts.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.shared_experts.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.shared_experts.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.shared_experts.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.shared_experts.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.shared_experts.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.shared_experts.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.switch_mlp.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.switch_mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.switch_mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.switch_mlp.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.switch_mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.14.mlp.switch_mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.14.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.attention.dense.biases": "model-00002-of-00002.safetensors",
        "model.layers.15.attention.dense.scales": "model-00002-of-00002.safetensors",
        "model.layers.15.attention.dense.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.attention.key_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.attention.query_key_value.biases": "model-00002-of-00002.safetensors",
        "model.layers.15.attention.query_key_value.scales": "model-00002-of-00002.safetensors",
        "model.layers.15.attention.query_key_value.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.attention.query_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.gate.expert_bias": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.gate.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.shared_experts.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.shared_experts.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.shared_experts.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.shared_experts.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.shared_experts.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.shared_experts.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.shared_experts.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.shared_experts.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.shared_experts.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.switch_mlp.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.switch_mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.switch_mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.switch_mlp.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.switch_mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.15.mlp.switch_mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.15.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.attention.dense.biases": "model-00002-of-00002.safetensors",
        "model.layers.16.attention.dense.scales": "model-00002-of-00002.safetensors",
        "model.layers.16.attention.dense.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.attention.key_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.attention.query_key_value.biases": "model-00002-of-00002.safetensors",
        "model.layers.16.attention.query_key_value.scales": "model-00002-of-00002.safetensors",
        "model.layers.16.attention.query_key_value.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.attention.query_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.gate.expert_bias": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.gate.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.shared_experts.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.shared_experts.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.shared_experts.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.shared_experts.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.shared_experts.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.shared_experts.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.shared_experts.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.shared_experts.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.shared_experts.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.switch_mlp.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.switch_mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.switch_mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.switch_mlp.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.switch_mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.16.mlp.switch_mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.16.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.attention.dense.biases": "model-00002-of-00002.safetensors",
        "model.layers.17.attention.dense.scales": "model-00002-of-00002.safetensors",
        "model.layers.17.attention.dense.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.attention.key_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.attention.query_key_value.biases": "model-00002-of-00002.safetensors",
        "model.layers.17.attention.query_key_value.scales": "model-00002-of-00002.safetensors",
        "model.layers.17.attention.query_key_value.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.attention.query_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.gate.expert_bias": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.gate.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.shared_experts.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.shared_experts.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.shared_experts.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.shared_experts.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.shared_experts.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.shared_experts.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.shared_experts.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.shared_experts.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.shared_experts.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.switch_mlp.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.switch_mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.switch_mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.switch_mlp.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.switch_mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.17.mlp.switch_mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.17.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.attention.dense.biases": "model-00002-of-00002.safetensors",
        "model.layers.18.attention.dense.scales": "model-00002-of-00002.safetensors",
        "model.layers.18.attention.dense.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.attention.key_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.attention.query_key_value.biases": "model-00002-of-00002.safetensors",
        "model.layers.18.attention.query_key_value.scales": "model-00002-of-00002.safetensors",
        "model.layers.18.attention.query_key_value.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.attention.query_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.gate.expert_bias": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.gate.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.shared_experts.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.shared_experts.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.shared_experts.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.shared_experts.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.shared_experts.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.shared_experts.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.shared_experts.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.shared_experts.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.shared_experts.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.switch_mlp.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.switch_mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.switch_mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.switch_mlp.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.switch_mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.switch_mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.attention.dense.biases": "model-00002-of-00002.safetensors",
        "model.layers.19.attention.dense.scales": "model-00002-of-00002.safetensors",
        "model.layers.19.attention.dense.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.attention.key_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.attention.query_key_value.biases": "model-00002-of-00002.safetensors",
        "model.layers.19.attention.query_key_value.scales": "model-00002-of-00002.safetensors",
        "model.layers.19.attention.query_key_value.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.attention.query_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.gate.expert_bias": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.gate.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.shared_experts.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.shared_experts.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.shared_experts.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.shared_experts.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.shared_experts.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.shared_experts.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.shared_experts.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.shared_experts.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.shared_experts.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.switch_mlp.down_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.switch_mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.switch_mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.switch_mlp.up_proj.biases": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.switch_mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.switch_mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.2.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.2.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.2.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.gate.expert_bias": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.gate.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.shared_experts.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.shared_experts.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.shared_experts.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.shared_experts.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.shared_experts.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.shared_experts.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.shared_experts.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.shared_experts.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.shared_experts.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.switch_mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.switch_mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.switch_mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.switch_mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.switch_mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.switch_mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.3.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.3.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.gate.expert_bias": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.gate.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.shared_experts.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.shared_experts.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.shared_experts.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.shared_experts.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.shared_experts.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.shared_experts.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.shared_experts.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.shared_experts.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.shared_experts.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.switch_mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.switch_mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.switch_mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.switch_mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.switch_mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.switch_mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.4.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.4.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.4.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.4.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.gate.expert_bias": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.gate.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.shared_experts.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.shared_experts.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.shared_experts.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.shared_experts.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.shared_experts.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.shared_experts.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.shared_experts.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.shared_experts.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.shared_experts.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.switch_mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.switch_mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.switch_mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.switch_mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.switch_mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.4.mlp.switch_mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.4.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.5.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.5.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.5.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.5.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.gate.expert_bias": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.gate.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.shared_experts.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.shared_experts.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.shared_experts.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.shared_experts.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.shared_experts.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.shared_experts.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.shared_experts.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.shared_experts.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.shared_experts.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.switch_mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.switch_mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.switch_mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.switch_mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.switch_mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.5.mlp.switch_mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.5.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.6.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.6.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.6.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.6.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.gate.expert_bias": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.gate.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.shared_experts.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.shared_experts.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.shared_experts.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.shared_experts.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.shared_experts.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.shared_experts.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.shared_experts.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.shared_experts.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.shared_experts.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.switch_mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.switch_mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.switch_mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.switch_mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.switch_mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.6.mlp.switch_mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.6.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.7.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.7.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.attention.query_key_value.biases": "model-00001-of-00002.safetensors",
        "model.layers.7.attention.query_key_value.scales": "model-00001-of-00002.safetensors",
        "model.layers.7.attention.query_key_value.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.attention.query_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.gate.expert_bias": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.gate.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.shared_experts.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.shared_experts.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.shared_experts.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.shared_experts.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.shared_experts.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.shared_experts.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.shared_experts.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.shared_experts.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.shared_experts.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.switch_mlp.down_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.switch_mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.switch_mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.switch_mlp.up_proj.biases": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.switch_mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.7.mlp.switch_mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.7.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.8.attention.dense.biases": "model-00001-of-00002.safetensors",
        "model.layers.8.attention.dense.scales": "model-00001-of-00002.safetensors",
        "model.layers.8.attention.dense.weight": "model-00001-of-00002.safetensors",
        "model.layers.8.attention.key_layernorm.weight": "model-00001-of-00002.safetensors",
